Repository: lennartgerken/shifts
Catalog: Shifts/Localizable.xcstrings
Source language: en
Languages: de

source: before the shift
de: vor der Schicht

# button.addEntry
source: Add entry
de: Eintrag hinzufügen

# button.addPattern
source: Add pattern
de: Muster hinzufügen

# button.addReminder
source: Add reminder
de: Erinnerung hinzufügen

# button.addShift
source: Add shift
de: Schicht hinzufügen

# button.addTag
source: Add tag
de: Tag hinzufügen

# button.cancel
source: Cancel
de: Abbrechen

# button.deleteShift
source: Delete shift
de: Schicht löschen

# button.deleteShiftReferences
source: delete references
de: Referenzen löschen

# button.done
source: Done
de: Fertig

# button.edit
source: Edit
de: Bearbeiten

# button.editReminders
source: Edit reminders
de: Erinnerungen bearbeiten

# button.editTags
source: Edit tags
de: Tags bearbeiten

# button.importSelectImage
source: Select an image of a working schedule
de: Wähle ein Foto eines Schichtplans

# button.importShifts
source: Import shifts
de: Schichten importieren

# button.jumpToToday
source: Jump to today
de: Springe zu Heute

# button.nextMonth
source: Next month
de: Nächster Monat

# button.openMenu
source: Open menu
de: Menü öffnen

# button.previousMonth
source: Previous month
de: Vorheriger Monat

# button.save
source: Save
de: Speichern

# button.saveAndNext
source: Save and next
de: Speichern und nächster

# button.selectDate
source: Select date
de: Wähle Datum

# button.selectTags
source: Select tags
de: Tags wählen

# button.settings
source: Settings
de: Einstellungen

# daysBeforeShift
source: %1$(days)lld day(s) before the shift
de: %1$(days)lld Tag(e) vor der Schicht

# description.import
source: You can automatically create shifts by importing an image of a working schedule.
de: Du kannst Schichten automatisch erstellen lassen, indem du das Foto eines Schichtplans importierst.

# description.noPatterns
source: Add pattern segments to create a pattern.
de: Füge Mustersegmente hinzu, um ein Muster zu erstellen.

# description.noReminders
source: You can add a reminder.
de: Du kannst eine Erinnerung hinzufügen.

# description.noShiftReferences
source: You can create shift references when creating or editing shifts.
de: Du kannst Schichtreferenzen erstellen, wenn du Schichten erstellst oder bearbeitest.

# description.noShifts
source: You can add a shift for this day.
de: Du kannst eine Schicht für diesen Tag hinzufügen.

# description.noTags
source: You can add a new tag.
de: Du kannst einen neuen Tag hinzufügen.

# error.emptyList
source: The list can’t be empty.
de: Die Liste darf nicht Leer sein.

# error.emptyName
source: Name is not allowed to be empty.
de: Der Name darf nicht leer sein.

# error.endBeforeStart
source: Start can not be after the end.
de: Der Beginn kann nicht nach dem Ende liegen.

# error.general
source: An error occurred.
de: Es ist ein Fehler aufgetreten.

# error.importConfigMissing
source: Please open the settings to configure the import configuration.
de: Bitte öffne die Einstellungen, um die benötigten Import-Konfigurationen vorzunehmen.

# error.importImageFailed
source: Image could not be loaded.
de: Das Foto konnte nicht geladen werden.

# error.invalidColor
source: The color is invalid.
de: Die Farbe ist ungültig.

# error.missingPatterns
source: Please provide the following patterns:
de: Folgende Muster müssen gesetzt sein:

# error.parseShiftsFailed
source: Shifts could not be parsed from the image.
de: Es konnten keine Schichten aus dem Foto ausgelesen werden.

# error.startEndMoreThanOneDay
source: Start and end can not be more than one day apart.
de: Beginn und Ende können nicht mehr als einen Tag voneinander entfernt sein.

# error.startIsEnd
source: Start and end can not be the same.
de: Beginn und Ende können nicht gleich sein.

# hoursBeforeShift
source: %1$(hours)lld hour(s) before the shift
de: %1$(hours)lld Stunde(n) vor der Schicht

# label.color
source: Color
de: Farbe

# label.count
source: Count
de: Anzahl

# label.date
source: Date
de: Datum

# label.dateIdentification
source: Date identification
de: Identifikation des Datums

# label.day
source: Day
de: Tag

# label.end
source: End
de: Ende

# label.endsSameDay
source: Ends at the same day
de: Endet am gleichen Tag

# label.notes
source: Notes
de: Notizen

# label.orMore
source: Or more
de: Oder mehr

# label.sendNotifications
source: Send notifications
de: Sende Benachrichtigungen

# label.start
source: Start
de: Beginn

# label.staticCharacters
source: Static characters
de: Statische Zeichen

# label.type
source: Type
de: Typ

# label.useAsReference
source: Use as reference
de: Als Referenz verwenden

# minutesBeforeShift
source: %1$(minutes)lld minute(s) before the shift
de: %1$(minutes)lld Minute(n) vor der Schicht

# notification.body.shiftReminderDays
source: Your shift starts in %1$(days)lld day(s).
de: Deine Schicht beginnt in %(days)lld Tag(en).

# notification.body.shiftReminderHours
source: Your shift starts in %1$(hours)lld hour(s).
de: Deine Schicht beginnt in %(hours)lld Stunde(n).

# notification.body.shiftReminderMinutes
source: Your shift starts in %1$(minutes)lld minute(s).
de: Deine Schicht beginnt in %(minutes)lld Minute(n).

# notifications.title.shiftReminder
source: Shift reminder
de: Schicht-Erinnerung

# pattern.Character
source: Any character
de: Alle Zeichen

# pattern.date
source: Pattern of the schedule date
de: Muster des Schichtplan-Datums

# pattern.import.day_dd
source: Date (dd)
de: Datum (dd)

# pattern.import.day_dd_MM_yyyy
source: Date (dd.MM.yyyy)
de: Datum (dd.MM.yyyy)

# pattern.import.end_HH_mm
source: End time (HH:mm)
de: Endzeit (HH:mm)

# pattern.import.month_dd_MM_yyyy
source: Month (dd.MM.yyyy)
de: Monat (dd.MM.yyyy)

# pattern.import.month_MM_yyyy
source: Month (MM.yyyy)
de: Monat (MM.yyyy)

# pattern.import.month_MMMM_yyyy
source: Month (MMMM yyyy)
de: Monat (MMMM yyyy)

# pattern.import.start_HH_mm
source: Start time (HH:mm)
de: Startzeit (HH:mm)

# pattern.number
source: Any numeric character
de: Jedes numerische Zeichen

# pattern.shiftEntry
source: Pattern of a shift entry
de: Muster eines Schichteintrags

# pattern.staticCharacters
source: Static characters
de: Statische Zeichen

# pattern.text
source: any textual character
de: Jedes Textzeichen

# pickerValue.days
source: Day(s)
de: Tag(e)

# pickerValue.hours
source: Hour(s)
de: Stunde(n)

# pickerValue.minutes
source: Minute(s)
de: Minute(n)

# pickerValue.seperate_dd_MM_yyyy
source: Separate date (dd.MM.yyyy)
de: Separates Datum (dd.MM.yyyy)

# pickerValue.seperate_MM_yyyy
source: Separate date (MM.yyyy)
de: Separates Datum (MM.yyyy)

# pickerValue.seperate_MMMM_yyyy
source: Separate date (MMMM yyyy)
de: Separates Datum (MMMM yyyy)

# pickerValue.wholeDate
source: Whole date in every line
de: Vollständiges Datum in jeder Zeile

# success.shiftSaved
source: Shift saved successfully:
de: Schicht wurde erfolgreich gespeichert:

# text.importInfo
source: These settings are required to enable the import of shifts from photos of shift schedules. They define how the shifts in the schedule can be recognized. %1$(labelDateIdentification)@ How can the date of individual shifts be determined? Either each row of the schedule contains the full date, or the date is listed separately. If the date is listed separately, each row only needs to contain the day number. The month and year will be read from a separate entry. %2$(patternShiftEntry)@ How can a shift be identified? A shift entry must be represented here using pattern segments. Suppose a shift entry is listed in the schedule as follows: 01 Shift 10:00 15:00 Then the entry can be identified using the following pattern: %3$(patternShiftEntryExample)@ %4$(patternDate)@ How can the month and year of the shift schedule be identified? If each shift row only contains the day (as in the example above), the month and year must be read from a separate entry. Suppose the schedule date is listed as follows: from: 01.01.2026 to: 31.01.2026 Then the month and year can be identified using the following pattern: %5$(patternDateExample)@
de: Diese Einstellungen werden benötigt, um den Import von Schichten aus Fotos von Schichtplänen zu ermöglichen. Es wird festgelegt, wie die Schichten in dem Plan erkannt werden können. \ \ **%1$(labelDateIdentification)@** \ \ Wie kann das Datum der einzelnen Schichten festgestellt werden? Entweder enthält jede Zeile des Plans das vollständige Datum oder das Datum ist separat aufgeführt. Bei einem separaten Datum muss jede Zeile nur die Nummer des Tages beinhalten. Der Monat und das Jahr werden aus einer separaten Angabe gelesen. \ \ **%2$(patternShiftEntry)@** \ \ Wie kann eine Schicht identifiziert werden? Aus Mustersegmenten muss hier ein Schichteintrag abgebildet werden. Angenommen ein Schichteintrag ist im Plan wie folgt angegeben: \ \ 01 Schicht 10:00 15:00 \ \ Dann kann der Eintrag über folgendes Muster identifiziert werden: \ \ %3$(patternShiftEntryExample)@ \ \ **%4$(patternDate)@** \ \ Wie können der Monat und das Jahr des Schichtplans identifiziert werden? Sofern jede Schichtzeile nur den Tag beinhaltet (wie im Beispiel oben), müssen der Monat und das Jahr aus einer separaten Angabe ausgelesen werden. Angenommen das Datum des Plans ist wie folgt angegeben: \ \ von: 01.01.2026 bis: 31.01.2026 \ \ Dann kann können Monat und Jahr über folgendes Muster identifiziert werden: \ \ %5$(patternDateExample)@

# title.addPattern
source: Add pattern
de: Muster hinzufügen

# title.addReminder
source: Add reminder
de: Erinnerung hinzufügen

# title.addShift
source: New shift
de: Neue Schicht

# title.addTag
source: Add tag
de: Tag hinzufügen

# title.deleteShiftReferences
source: Delete references
de: Referenzen löschen

# title.editPattern
source: Edit pattern
de: Muster bearbeiten

# title.editReminders
source: Edit reminders
de: Erinnerungen bearbeiten

# title.editShift
source: Edit shift
de: Schicht bearbeiten

# title.editTag
source: Edit tag
de: Tag bearbeiten

# title.editTags
source: Edit tags
de: Tags bearbeiten

# title.importShifts
source: Import shifts
de: Schichten importieren

# title.noPatterns
source: No pattern segments
de: Keine Mustersegmente

# title.noReminders
source: No reminders
de: Keine Erinnerungen

# title.noShiftReferences
source: No references
de: Keine Referenz

# title.noShifts
source: No shifts
de: Keine Schichten

# title.noTags
source: No tags
de: Keine Tags

# title.notes
source: Notes
de: Notizen

# title.notifications
source: Notifications
de: Benachrichtigungen

# title.selectTags
source: Select tags
de: Tags wählen

# title.settings
source: Settings
de: Einstellungen

# title.shift
source: Shift
de: Schicht

# title.shiftReferences
source: References
de: Referenzen

# title.useAsReference
source: Use as reference
de: Als Referenz verwenden
